# GroupCannotSaveWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..GroupCannotSaveWarn Property
BuiltInFailures..::..GroupFailures Class See Also
---
The group cannot be saved at this time because one of its instances is being edited.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GroupCannotSaveWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GroupCannotSaveWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GroupCannotSaveWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace